In [17]:
import pandas as pd
import numpy as np
import random

In [18]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### set_index()

In [19]:
# create non-repititive value for the index
new_index = np.arange(0, 1000)

In [20]:
# shuffle the indexes using random

random.shuffle(new_index)

In [21]:
# create a new column with the index

df_exams['new index'] = new_index
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new index
0,female,group B,bachelor's degree,standard,none,72,72,74,317
1,female,group C,some college,standard,completed,69,90,88,670
2,female,group B,master's degree,standard,none,90,95,93,617
3,male,group A,associate's degree,free/reduced,none,47,57,44,459
4,male,group C,some college,standard,none,76,78,75,192

In [22]:
# set the 'new index' column as index using 'set_index()'

df_exams.set_index('new index', inplace=True)
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new index,,,,,,,,
317,female,group B,bachelor's degree,standard,none,72,72,74
670,female,group C,some college,standard,completed,69,90,88
617,female,group B,master's degree,standard,none,90,95,93
459,male,group A,associate's degree,free/reduced,none,47,57,44
192,male,group C,some college,standard,none,76,78,75

### sort_index()

In [26]:
# sort the data frame by the new index using 'sort_index()'

df_exams.sort_index(inplace=True)
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new index,,,,,,,,
0,male,group C,associate's degree,standard,none,76,70,68
1,female,group C,associate's degree,standard,none,59,66,67
2,male,group D,some high school,free/reduced,completed,55,59,59
3,female,group E,bachelor's degree,free/reduced,none,61,58,62
4,female,group C,some high school,free/reduced,none,0,17,10